<a href="https://colab.research.google.com/github/youkyung2/dataAnalysis/blob/master/%ED%8C%90%EB%8B%A4%EC%8A%A4_%EC%97%B0%EC%8A%B5_%ED%8A%9C%ED%86%A0%EB%A6%AC%EC%96%BC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

판다스 연습 튜토리얼

* 참고 URL : https://www.datamanim.com/dataset/99_pandas/pandasMain.html
* 업로드 데이터셋 : https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data

In [1]:
import pandas as pd
import numpy as np

### 01. Getting & Knowing Data

In [5]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/Jeju.csv', encoding='EUC-KR')
df.head()

      id          일자   시도명  읍면동명  ...  평균 소요 시간  평균 기온  일강수량  평균 풍속
0  22448  2018-01-01   제주시   도두동  ...    29.167    5.0   0.0    2.5
1  22449  2018-01-01   제주시   외도동  ...    30.900    5.0   0.0    2.5
2  22450  2018-01-01   제주시  이도2동  ...    35.692    2.9   0.0    2.4
3  22451  2018-01-01   제주시  일도1동  ...    23.500    2.9   0.0    2.4
4  22452  2018-01-01  서귀포시   대천동  ...    14.375    5.1   0.0    2.3

[5 rows x 13 columns]

In [6]:
df.tail(3)

         id          일자   시도명 읍면동명  ...  평균 소요 시간  평균 기온  일강수량  평균 풍속
9618  32066  2020-04-30   제주시  도두동  ...    29.421   20.3   0.0    3.0
9619  32067  2020-04-30  서귀포시  안덕면  ...    49.189   17.6   0.0    3.5
9620  32068  2020-04-30   제주시   연동  ...    27.765   14.1   0.0    4.8

[3 rows x 13 columns]

In [13]:
df.columns[df.dtypes != 'object']

Index(['id', '거주인구', '근무인구', '방문인구', '총 유동인구', '평균 속도', '평균 소요 시간', '평균 기온',
       '일강수량', '평균 풍속'],
      dtype='object')

In [17]:
df.select_dtypes(include=np.number).columns

Index(['id', '거주인구', '근무인구', '방문인구', '총 유동인구', '평균 속도', '평균 소요 시간', '평균 기온',
       '일강수량', '평균 풍속'],
      dtype='object')

In [18]:
df.select_dtypes(include=np.object).columns

Index(['일자', '시도명', '읍면동명'], dtype='object')

In [19]:
df.isnull().sum()

id          0
일자          0
시도명         0
읍면동명        0
거주인구        0
근무인구        0
방문인구        0
총 유동인구      0
평균 속도       0
평균 소요 시간    0
평균 기온       0
일강수량        0
평균 풍속       0
dtype: int64

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9621 entries, 0 to 9620
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        9621 non-null   int64
 1   일자        9621 non-null   object
 2   시도명       9621 non-null   object
 3   읍면동명      9621 non-null   object
 4   거주인구      9621 non-null   float64
 5   근무인구      9621 non-null   float64
 6   방문인구      9621 non-null   float64
 7   총 유동인구    9621 non-null   float64
 8   평균 속도     9621 non-null   float64
 9   평균 소요 시간  9621 non-null   float64
 10  평균 기온     9621 non-null   float64
 11  일강수량      9621 non-null   float64
 12  평균 풍속     9621 non-null   float64
dtypes: float64(9), int64(1), object(3)
memory usage: 977.3+ KB

In [23]:
df.describe()

                 id          거주인구  ...         일강수량        평균 풍속
count   9621.000000  9.621000e+03  ...  9621.000000  9621.000000
mean   27258.000000  3.174315e+05  ...     6.972426     2.753171
std     2777.487804  2.982079e+05  ...    27.617260     1.498538
min    22448.000000  9.305552e+03  ...     0.000000     0.000000
25%    24853.000000  9.539939e+04  ...     0.000000     1.700000
50%    27258.000000  2.221105e+05  ...     0.000000     2.400000
75%    29663.000000  4.106671e+05  ...     1.500000     3.400000
max    32068.000000  1.364504e+06  ...   587.500000    13.333000

[8 rows x 10 columns]

In [24]:
df['거주인구']

0         32249.987
1        213500.997
2       1212382.218
3         33991.653
4        155036.925
           ...
9616     228260.005
9617     459959.064
9618      28397.481
9619     348037.846
9620    1010643.372
Name: 거주인구, Length: 9621, dtype: float64

In [29]:
df['평균 속도'].quantile(3/4) - df['평균 속도'].quantile(1/4)

14.854999999999997

In [38]:
len(df['읍면동명'].unique())

41

In [39]:
df['읍면동명'].nunique()

41

In [40]:
df['읍면동명'].unique()

array(['도두동', '외도동', '이도2동', '일도1동', '대천동', '서홍동', '한경면', '송산동', '조천읍',
       '일도2동', '영천동', '예래동', '대륜동', '삼도1동', '이호동', '건입동', '중앙동', '삼양동',
       '삼도2동', '이도1동', '남원읍', '대정읍', '정방동', '효돈동', '아라동', '한림읍', '구좌읍',
       '용담1동', '오라동', '화북동', '연동', '표선면', '중문동', '성산읍', '안덕면', '천지동',
       '노형동', '동홍동', '용담2동', '봉개동', '애월읍'], dtype=object)

02. Filtering & Sorting

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/chipo.csv', encoding='EUC-KR')
df.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [6]:
df[df.quantity == 3].head()

     order_id  ...  item_price
409       178  ...     $32.94
445       193  ...     $22.20
689       284  ...      $3.75
818       338  ...      $3.27
850       350  ...      $3.75

[5 rows x 5 columns]

In [8]:
df[df.quantity == 3].reset_index(drop=True).head(5)

   order_id  ...  item_price
0       178  ...     $32.94
1       193  ...     $22.20
2       284  ...      $3.75
3       338  ...      $3.27
4       350  ...      $3.75

[5 rows x 5 columns]

In [11]:
df[['quantity','item_price']]

      quantity item_price
0            1     $2.39
1            1     $3.39
2            1     $3.39
3            1     $2.39
4            2    $16.98
...        ...        ...
4617         1    $11.75
4618         1    $11.75
4619         1    $11.25
4620         1     $8.75
4621         1     $8.75

[4622 rows x 2 columns]

In [16]:
df['new_price'] = df['item_price'].replace('$','')

TypeError: ignored

In [20]:
df['new_price'] = df['item_price'].apply(lambda x : float(x.replace('$','')))

In [21]:
df['new_price']

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: new_price, Length: 4622, dtype: float64

In [25]:
df.select_dtypes(include = np.number).columns

Index(['order_id', 'quantity', 'new_price'], dtype='object')

In [35]:
len(df[df['new_price'] <= 5])

1652

In [37]:
df[df.item_name == 'Chicken Salad Bowl'].reset_index(drop=True)

     order_id  quantity  ... item_price new_price
0          20         1  ...     $8.75       8.75
1          60         2  ...    $22.50      22.50
2          94         2  ...    $22.50      22.50
3         111         1  ...     $8.75       8.75
4         137         2  ...    $17.50      17.50
..        ...       ...  ...        ...       ...
105      1813         2  ...    $17.50      17.50
106      1822         1  ...    $11.25      11.25
107      1834         1  ...    $11.25      11.25
108      1834         1  ...     $8.75       8.75
109      1834         1  ...     $8.75       8.75

[110 rows x 6 columns]

In [41]:
df[(df.new_price<=9) & (df.item_name == 'Chicken Salad Bowl')]

      order_id  quantity  ... item_price new_price
44          20         1  ...     $8.75       8.75
256        111         1  ...     $8.75       8.75
526        220         1  ...     $8.75       8.75
528        221         1  ...     $8.75       8.75
529        221         1  ...     $8.75       8.75
568        234         1  ...     $8.75       8.75
585        240         1  ...     $8.75       8.75
693        286         1  ...     $8.75       8.75
702        289         1  ...     $8.75       8.75
762        314         1  ...     $8.75       8.75
1109       458         1  ...     $8.75       8.75
1460       592         1  ...     $8.75       8.75
1471       598         1  ...     $8.75       8.75
1483       602         1  ...     $8.75       8.75
1547       628         1  ...     $8.75       8.75
1601       649         1  ...     $8.75       8.75
1621       654         1  ...     $8.75       8.75
1756       709         1  ...     $8.75       8.75
1977       798         1  ...     $8.75       8.75
2031       818         1  ...     $8.75       8.75
2113       850         1  ...     $8.75       8.75
2224       896         1  ...     $8.75       8.75
2314       926         1  ...     $8.75       8.75
2728      1083         1  ...     $8.75       8.75
2858      1136         1  ...     $8.75       8.75
2883      1145         1  ...     $8.75       8.75
2897      1152         1  ...     $8.75       8.75
2989      1189         1  ...     $8.75       8.75
3033      1206         1  ...     $8.75       8.75
3069      1222         1  ...     $8.75       8.75
3117      1243         1  ...     $8.75       8.75
3259      1305         1  ...     $8.75       8.75
3261      1305         1  ...     $8.75       8.75
3310      1327         1  ...     $8.75       8.75
3315      1329         1  ...     $8.75       8.75
3381      1357         1  ...     $8.75       8.75
3411      1368         1  ...     $8.75       8.75
3623      1450         1  ...     $8.75       8.75
3656      1461         1  ...     $8.75       8.75
3706      1483         1  ...     $8.75       8.75
3712      1483         1  ...     $8.75       8.75
3790      1517         1  ...     $8.75       8.75
3798      1521         1  ...     $8.75       8.75
3974      1592         1  ...     $8.75       8.75
3997      1601         1  ...     $8.75       8.75
4012      1606         1  ...     $8.75       8.75
4035      1615         1  ...     $8.75       8.75
4064      1627         1  ...     $8.75       8.75
4205      1679         1  ...     $8.75       8.75
4207      1679         1  ...     $8.75       8.75
4333      1730         1  ...     $8.75       8.75
4352      1738         1  ...     $8.75       8.75
4439      1769         1  ...     $8.75       8.75
4520      1797         1  ...     $8.75       8.75
4620      1834         1  ...     $8.75       8.75
4621      1834         1  ...     $8.75       8.75

[56 rows x 6 columns]

In [47]:
df.sort_values('new_price').reset_index(drop=True)

      order_id  quantity  ... item_price new_price
0          471         1  ...     $1.09       1.09
1          338         1  ...     $1.09       1.09
2         1575         1  ...     $1.09       1.09
3           47         1  ...     $1.09       1.09
4         1014         1  ...     $1.09       1.09
...        ...       ...  ...        ...       ...
4617      1443         3  ...    $33.75      33.75
4618      1443         4  ...    $35.00      35.00
4619       511         4  ...    $35.00      35.00
4620      1398         3  ...    $35.25      35.25
4621      1443        15  ...    $44.25      44.25

[4622 rows x 6 columns]

In [54]:
df[df.item_name.str.contains('Chips')]

      order_id  quantity  ... item_price new_price
0            1         1  ...     $2.39       2.39
3            1         1  ...     $2.39       2.39
6            3         1  ...     $1.69       1.69
10           5         1  ...     $4.45       4.45
14           7         1  ...     $4.45       4.45
...        ...       ...  ...        ...       ...
4596      1826         1  ...     $4.45       4.45
4600      1827         1  ...     $4.45       4.45
4605      1828         1  ...     $4.45       4.45
4613      1831         1  ...     $2.15       2.15
4616      1832         1  ...     $4.45       4.45

[1084 rows x 6 columns]

In [56]:
df.iloc[:,::2]

      order_id                              item_name item_price
0            1           Chips and Fresh Tomato Salsa     $2.39
1            1                                   Izze     $3.39
2            1                       Nantucket Nectar     $3.39
3            1  Chips and Tomatillo-Green Chili Salsa     $2.39
4            2                           Chicken Bowl    $16.98
...        ...                                    ...        ...
4617      1833                          Steak Burrito    $11.75
4618      1833                          Steak Burrito    $11.75
4619      1834                     Chicken Salad Bowl    $11.25
4620      1834                     Chicken Salad Bowl     $8.75
4621      1834                     Chicken Salad Bowl     $8.75

[4622 rows x 3 columns]

In [58]:
df.sort_values('new_price', ascending=False).reset_index(drop=True)

      order_id  quantity  ... item_price new_price
0         1443        15  ...    $44.25      44.25
1         1398         3  ...    $35.25      35.25
2          511         4  ...    $35.00      35.00
3         1443         4  ...    $35.00      35.00
4         1443         3  ...    $33.75      33.75
...        ...       ...  ...        ...       ...
4617      1578         1  ...     $1.09       1.09
4618      1162         1  ...     $1.09       1.09
4619       567         1  ...     $1.09       1.09
4620      1014         1  ...     $1.09       1.09
4621       591         1  ...     $1.09       1.09

[4622 rows x 6 columns]

In [60]:
df[(df.item_name == 'Steak Salad') | (df.item_name == 'Bowl')]

      order_id  quantity  ... item_price new_price
445        193         3  ...    $22.20      22.20
664        276         1  ...     $8.99       8.99
673        279         1  ...     $7.40       7.40
752        311         1  ...     $8.99       8.99
893        369         1  ...     $8.99       8.99
3502      1406         1  ...     $8.69       8.69

[6 rows x 6 columns]

In [70]:
df.loc[(df.item_name == 'Steak Salad') | (df.item_name == 'Bowl')].drop_duplicates('item_name',keep='first')

     order_id  quantity  ... item_price new_price
445       193         3  ...    $22.20      22.20
664       276         1  ...     $8.99       8.99

[2 rows x 6 columns]

In [73]:
df[(df.item_name == 'Steak Salad') | (df.item_name == 'Bowl')].drop_duplicates('item_name', keep='last')

      order_id  quantity  ... item_price new_price
673        279         1  ...     $7.40       7.40
3502      1406         1  ...     $8.69       8.69

[2 rows x 6 columns]

In [74]:
df.new_price.mean()

7.464335785374397

In [80]:
df[df.new_price >= df.new_price.mean()]

      order_id  quantity  ... item_price new_price
4            2         2  ...    $16.98      16.98
5            3         1  ...    $10.98      10.98
7            4         1  ...    $11.75      11.75
8            4         1  ...     $9.25       9.25
9            5         1  ...     $9.25       9.25
...        ...       ...  ...        ...       ...
4617      1833         1  ...    $11.75      11.75
4618      1833         1  ...    $11.75      11.75
4619      1834         1  ...    $11.25      11.25
4620      1834         1  ...     $8.75       8.75
4621      1834         1  ...     $8.75       8.75

[2890 rows x 6 columns]

In [84]:
df.loc[df.item_name == 'Izze','item_name'] = 'Fizzy Lizzy'
df[df.item_name == 'Fizzy Lizzy']

      order_id  quantity    item_name choice_description item_price  new_price
1            1         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
24          12         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
47          21         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
66          30         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
359        155         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
360        155         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
430        186         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
579        237         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
580        237         1  Fizzy Lizzy       [Grapefruit]     $3.39        3.39
1059       436         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
1213       495         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
1611       651         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
1612       651         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
1680       680         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2088       842         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2619      1040         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2634      1046         1  Fizzy Lizzy       [Clementine]     $3.39        3.39
2758      1095         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
2891      1149         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39
3669      1468         1  Fizzy Lizzy       [Blackberry]     $3.39        3.39

In [85]:
df[df.item_name == 'Izze']

Empty DataFrame
Columns: [order_id, quantity, item_name, choice_description, item_price, new_price]
Index: []

In [86]:
df.choice_description.isnull().sum()

1246

In [87]:
df.isnull().sum()

order_id                 0
quantity                 0
item_name                0
choice_description    1246
item_price               0
new_price                0
dtype: int64

In [88]:
df.loc[df.choice_description.isnull(),'choice_description'] = 'NoData'
df.choice_description.isnull().sum()

0

In [89]:
df[df.choice_description == 'NoData']

      order_id  quantity  ... item_price new_price
0            1         1  ...     $2.39       2.39
3            1         1  ...     $2.39       2.39
6            3         1  ...     $1.69       1.69
10           5         1  ...     $4.45       4.45
14           7         1  ...     $4.45       4.45
...        ...       ...  ...        ...       ...
4600      1827         1  ...     $4.45       4.45
4605      1828         1  ...     $4.45       4.45
4613      1831         1  ...     $2.15       2.15
4614      1831         1  ...     $1.50       1.50
4616      1832         1  ...     $4.45       4.45

[1246 rows x 6 columns]

In [91]:
df[df.choice_description.str.contains('Black')]

      order_id  quantity  ... item_price new_price
4            2         2  ...    $16.98      16.98
7            4         1  ...    $11.75      11.75
9            5         1  ...     $9.25       9.25
11           6         1  ...     $8.75       8.75
12           6         1  ...     $8.75       8.75
...        ...       ...  ...        ...       ...
4604      1828         1  ...     $8.75       8.75
4608      1829         1  ...    $11.25      11.25
4611      1830         1  ...    $11.25      11.25
4612      1831         1  ...     $9.25       9.25
4617      1833         1  ...    $11.75      11.75

[1353 rows x 6 columns]

In [105]:
len(df[~(df.choice_description.str.contains('Vegetables'))])

3900

In [114]:
df[df.item_name.str.startswith('N')]

      order_id  quantity  ... item_price new_price
2            1         1  ...     $3.39       3.39
22          11         1  ...     $3.39       3.39
105         46         1  ...     $3.39       3.39
173         77         1  ...     $3.39       3.39
205         91         1  ...     $3.39       3.39
436        189         1  ...     $3.39       3.39
601        247         2  ...     $6.78       6.78
925        381         1  ...     $3.39       3.39
1356       553         1  ...     $3.39       3.39
1585       641         1  ...     $3.39       3.39
1626       656         1  ...     $3.39       3.39
1706       690         1  ...     $3.39       3.39
2162       872         1  ...     $3.39       3.39
2379       947         2  ...     $6.78       6.78
2381       947         1  ...     $3.39       3.39
2430       965         1  ...     $3.39       3.39
2653      1053         1  ...     $3.39       3.39
2818      1118         1  ...     $3.39       3.39
2838      1128         1  ...     $3.39       3.39
2853      1133         1  ...     $3.39       3.39
2949      1172         1  ...     $3.39       3.39
3318      1330         1  ...     $3.39       3.39
3368      1351         1  ...     $3.39       3.39
3570      1433         1  ...     $3.39       3.39
3845      1541         1  ...     $3.39       3.39
4019      1609         1  ...     $3.39       3.39
4078      1632         1  ...     $3.39       3.39

[27 rows x 6 columns]

In [117]:
len('Chips')

5

In [ ]:
df[df.item_name.str.len() >= 15]

In [119]:
df[df['item_name'].apply(lambda x : len(x) >= 15)]

      order_id  quantity  ... item_price new_price
0            1         1  ...     $2.39       2.39
2            1         1  ...     $3.39       3.39
3            1         1  ...     $2.39       2.39
8            4         1  ...     $9.25       9.25
10           5         1  ...     $4.45       4.45
...        ...       ...  ...        ...       ...
4615      1832         1  ...     $8.75       8.75
4616      1832         1  ...     $4.45       4.45
4619      1834         1  ...    $11.25      11.25
4620      1834         1  ...     $8.75       8.75
4621      1834         1  ...     $8.75       8.75

[2373 rows x 6 columns]

In [130]:
lst =[1.69, 2.39, 3.39, 4.45, 9.25, 10.98, 11.75, 16.98]

ValueError: ignored

In [135]:
df[df.new_price.apply(lambda x : float(x) in lst)]

      order_id  quantity  ... item_price new_price
0            1         1  ...     $2.39       2.39
1            1         1  ...     $3.39       3.39
2            1         1  ...     $3.39       3.39
3            1         1  ...     $2.39       2.39
4            2         2  ...    $16.98      16.98
...        ...       ...  ...        ...       ...
4610      1830         1  ...    $11.75      11.75
4612      1831         1  ...     $9.25       9.25
4616      1832         1  ...     $4.45       4.45
4617      1833         1  ...    $11.75      11.75
4618      1833         1  ...    $11.75      11.75

[1393 rows x 6 columns]

In [136]:
df.new_price.isin(lst)

0        True
1        True
2        True
3        True
4        True
        ...
4617     True
4618     True
4619    False
4620    False
4621    False
Name: new_price, Length: 4622, dtype: bool

03. Grouping

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/AB_NYC_2019.csv')
df.head()

     id  ... availability_365
0  2539  ...              365
1  2595  ...              355
2  3647  ...              365
3  3831  ...              194
4  5022  ...                0

[5 rows x 16 columns]

In [10]:
df.groupby('host_name').size()
df.host_name.value_counts().sort_index()

'Cil                        1
(Ari) HENRY LEE             1
(Email hidden by Airbnb)    6
(Mary) Haiy                 1
-TheQueensCornerLot         1
                           ..
단비                          1
빈나                          1
소정                          2
진                           1
현선                          1
Name: host_name, Length: 11452, dtype: int64

In [13]:
df.host_name.value_counts()

Michael           417
David             403
Sonder (NYC)      327
John              294
Alex              279
                 ...
Marilena            1
Suvi                1
Camellia            1
Reymon              1
Yoseph & Malky      1
Name: host_name, Length: 11452, dtype: int64

In [35]:
 df.groupby('host_name').size().to_frame().rename(columns={0:'counts'}).\
 sort_values('counts', ascending=False)

              counts
host_name
Michael          417
David            403
Sonder (NYC)     327
John             294
Alex             279
...              ...
Jerbean            1
Jerald             1
Jeonghoon          1
Jeny               1
현선                 1

[11452 rows x 1 columns]

In [44]:
df.groupby(['neighbourhood_group','neighbourhood']).size().reset_index().\
rename(columns={0:'size'})

    neighbourhood_group  neighbourhood  size
0                 Bronx       Allerton    42
1                 Bronx     Baychester     7
2                 Bronx        Belmont    24
3                 Bronx      Bronxdale    19
4                 Bronx    Castle Hill     9
..                  ...            ...   ...
216       Staten Island    Tottenville     7
217       Staten Island  West Brighton    18
218       Staten Island    Westerleigh     2
219       Staten Island    Willowbrook     1
220       Staten Island        Woodrow     1

[221 rows x 3 columns]

In [45]:
df.groupby(['neighbourhood_group','neighbourhood'], as_index=False).size()

    neighbourhood_group  neighbourhood  size
0                 Bronx       Allerton    42
1                 Bronx     Baychester     7
2                 Bronx        Belmont    24
3                 Bronx      Bronxdale    19
4                 Bronx    Castle Hill     9
..                  ...            ...   ...
216       Staten Island    Tottenville     7
217       Staten Island  West Brighton    18
218       Staten Island    Westerleigh     2
219       Staten Island    Willowbrook     1
220       Staten Island        Woodrow     1

[221 rows x 3 columns]

In [48]:
df.groupby(['neighbourhood_group','neighbourhood'],as_index=False).size()\
.groupby(['neighbourhood_group'],as_index=False).max()

  neighbourhood_group    neighbourhood  size
0               Bronx         Woodlawn    70
1            Brooklyn  Windsor Terrace  3920
2           Manhattan     West Village  2658
3              Queens         Woodside   900
4       Staten Island          Woodrow    48

In [50]:
df.groupby(['neighbourhood_group','neighbourhood'],as_index=False).size()

    neighbourhood_group  neighbourhood  size
0                 Bronx       Allerton    42
1                 Bronx     Baychester     7
2                 Bronx        Belmont    24
3                 Bronx      Bronxdale    19
4                 Bronx    Castle Hill     9
..                  ...            ...   ...
216       Staten Island    Tottenville     7
217       Staten Island  West Brighton    18
218       Staten Island    Westerleigh     2
219       Staten Island    Willowbrook     1
220       Staten Island        Woodrow     1

[221 rows x 3 columns]

In [55]:
df.groupby('neighbourhood_group')['price'].agg(['mean', 'var', 'max', 'min'])

                           mean           var    max  min
neighbourhood_group
Bronx                 87.496792  11386.885081   2500    0
Brooklyn             124.383207  34921.719135  10000    0
Manhattan            196.875814  84904.159185  10000    0
Queens                99.517649  27923.130227  10000   10
Staten Island        114.812332  77073.088342   5000   13

In [57]:
df[['neighbourhood_group','price']].groupby('neighbourhood_group').agg(['max','var','mean','min'])

                     price
                       max           var        mean min
neighbourhood_group
Bronx                 2500  11386.885081   87.496792   0
Brooklyn             10000  34921.719135  124.383207   0
Manhattan            10000  84904.159185  196.875814   0
Queens               10000  27923.130227   99.517649  10
Staten Island         5000  77073.088342  114.812332  13

In [58]:
df[['neighbourhood_group','price']]

      neighbourhood_group  price
0                Brooklyn    149
1               Manhattan    225
2               Manhattan    150
3                Brooklyn     89
4               Manhattan     80
...                   ...    ...
48890            Brooklyn     70
48891            Brooklyn     40
48892           Manhattan    115
48893           Manhattan     55
48894           Manhattan     90

[48895 rows x 2 columns]

In [65]:
df[['neighbourhood_group','reviews_per_month']].groupby('neighbourhood_group').agg(['mean','var','max','min'])

                    reviews_per_month
                                 mean       var    max   min
neighbourhood_group
Bronx                        1.837831  2.799878  10.34  0.02
Brooklyn                     1.283212  2.299040  14.00  0.01
Manhattan                    1.272131  2.651206  58.50  0.01
Queens                       1.941200  4.897848  20.94  0.01
Staten Island                1.872580  2.840895  10.12  0.02

In [67]:
df.groupby(['neighbourhood','neighbourhood_group']).price.mean()

neighbourhood    neighbourhood_group
Allerton         Bronx                   87.595238
Arden Heights    Staten Island           67.250000
Arrochar         Staten Island          115.000000
Arverne          Queens                 171.779221
Astoria          Queens                 117.187778
                                           ...
Windsor Terrace  Brooklyn               138.993631
Woodhaven        Queens                  67.170455
Woodlawn         Bronx                   60.090909
Woodrow          Staten Island          700.000000
Woodside         Queens                  85.097872
Name: price, Length: 221, dtype: float64

In [68]:
df.groupby(['neighbourhood','neighbourhood_group']).price.mean().unstack()

neighbourhood_group      Bronx    Brooklyn  ...      Queens  Staten Island
neighbourhood                               ...
Allerton             87.595238         NaN  ...         NaN            NaN
Arden Heights              NaN         NaN  ...         NaN          67.25
Arrochar                   NaN         NaN  ...         NaN         115.00
Arverne                    NaN         NaN  ...  171.779221            NaN
Astoria                    NaN         NaN  ...  117.187778            NaN
...                        ...         ...  ...         ...            ...
Windsor Terrace            NaN  138.993631  ...         NaN            NaN
Woodhaven                  NaN         NaN  ...   67.170455            NaN
Woodlawn             60.090909         NaN  ...         NaN            NaN
Woodrow                    NaN         NaN  ...         NaN         700.00
Woodside                   NaN         NaN  ...   85.097872            NaN

[221 rows x 5 columns]

In [69]:
df.groupby(['neighbourhood','neighbourhood_group']).price.mean().unstack().fillna(-999)

neighbourhood_group       Bronx    Brooklyn  ...      Queens  Staten Island
neighbourhood                                ...
Allerton              87.595238 -999.000000  ... -999.000000        -999.00
Arden Heights       -999.000000 -999.000000  ... -999.000000          67.25
Arrochar            -999.000000 -999.000000  ... -999.000000         115.00
Arverne             -999.000000 -999.000000  ...  171.779221        -999.00
Astoria             -999.000000 -999.000000  ...  117.187778        -999.00
...                         ...         ...  ...         ...            ...
Windsor Terrace     -999.000000  138.993631  ... -999.000000        -999.00
Woodhaven           -999.000000 -999.000000  ...   67.170455        -999.00
Woodlawn              60.090909 -999.000000  ... -999.000000        -999.00
Woodrow             -999.000000 -999.000000  ... -999.000000         700.00
Woodside            -999.000000 -999.000000  ...   85.097872        -999.00

[221 rows x 5 columns]

In [75]:
df[df.neighbourhood_group == 'Queens'].groupby('neighbourhood').price.agg(
    ['mean','var','max','min'])

                           mean            var    max  min
neighbourhood
Arverne              171.779221   37383.411141   1500   35
Astoria              117.187778  122428.811196  10000   25
Bay Terrace          142.000000    6816.400000    258   32
Bayside              157.948718  166106.470985   2600   30
Bayswater             87.470588    2330.889706    230   45
Belle Harbor         171.500000    8226.571429    350   85
Bellerose             99.357143    3093.016484    240   42
Breezy Point         213.333333    1008.333333    250  195
Briarwood            105.875000   18503.165909   1000   30
Cambria Heights       81.730769    2960.604615    250   31
College Point         88.000000    6445.555556    400   44
Corona                59.171875    2430.557292    359   23
Ditmars Steinway      95.029126    4214.112785    600   22
Douglaston            82.750000    2347.071429    178   40
East Elmhurst         81.183784    4369.487779    700   16
Edgemere              94.727273    4219.418182    200   40
Elmhurst              80.459916    3896.563005    443   15
Far Rockaway         165.862069   52575.980296    900   35
Flushing              93.514085   12417.177448   1500   15
Forest Hills         121.625000   44533.368881   2350   16
Fresh Meadows         99.500000    6394.451613    375   39
Glendale              90.796296    3230.882250    299   25
Hollis                88.642857    1483.016484    175   50
Holliswood           135.750000    5091.583333    239   79
Howard Beach         115.400000    4241.936842    250   40
Jackson Heights       80.897849    2150.470590    260   23
Jamaica               95.770563    8067.047130   1000   10
Jamaica Estates      182.947368   29006.052632    750   35
Jamaica Hills        132.125000   11304.696429    325   50
Kew Gardens           88.375000    2632.306452    219   35
Kew Gardens Hills    112.307692    6230.621538    399   40
Laurelton             95.333333    4355.529412    254   34
Little Neck           75.200000    2368.700000    149   32
Long Island City     127.465549   15529.503009   2000   30
Maspeth               83.645455    2223.607089    245   11
Middle Village       109.580645    3537.118280    265   28
Neponsit             274.666667    5625.333333    350  200
Ozone Park            85.274194    1705.415389    200   25
Queens Village        83.933333    2386.470056    320   25
Rego Park             83.877358    3659.003863    300   21
Richmond Hill         87.117021    3474.147449    300   28
Ridgewood             77.184397    2629.311889    375   20
Rockaway Beach       132.178571    6254.622078    545   49
Rosedale              76.694915    2963.939801    350   22
South Ozone Park      82.400000    4619.989744    400   29
Springfield Gardens   94.235294    2490.848739    300   40
St. Albans           100.828947    9489.903684    600   25
Sunnyside             84.865014    2727.746922    600   12
Whitestone           107.545455   13632.072727    400   35
Woodhaven             67.170455    1642.464864    250   10
Woodside              85.097872    5001.900636    500   28

In [96]:
ans = df.groupby(['neighbourhood_group','room_type']).size().unstack()
ans

room_type            Entire home/apt  Private room  Shared room
neighbourhood_group
Bronx                            379           652           60
Brooklyn                        9559         10132          413
Manhattan                      13199          7982          480
Queens                          2096          3372          198
Staten Island                    176           188            9

In [94]:
df.groupby(['neighbourhood_group']).size().to_frame()

                         0
neighbourhood_group
Bronx                 1091
Brooklyn             20104
Manhattan            21661
Queens                5666
Staten Island          373

In [100]:
ans.loc[:] = ans.values / ans.sum(axis=1).values.reshape(-1,1)
ans

room_type            Entire home/apt  Private room  Shared room
neighbourhood_group
Bronx                       0.347388      0.597617     0.054995
Brooklyn                    0.475478      0.503979     0.020543
Manhattan                   0.609344      0.368496     0.022160
Queens                      0.369926      0.595129     0.034945
Staten Island               0.471850      0.504021     0.024129

04. apply, map

In [109]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/BankChurnersUp.csv',index_col=0)
df.head(2)

   CLIENTNUM     Attrition_Flag  ...  Total_Amt_Chng_Q4_Q1 Total_Trans_Amt
0  768805383  Existing Customer  ...                 1.335            1144
1  818770008  Existing Customer  ...                 1.541            1291

[2 rows x 18 columns]

In [110]:
df.shape

(10127, 18)

In [111]:
dic = {
    'Unknown'        : 'N',
    'Less than $40K' : 'a',
    '$40K - $60K'    : 'b',
    '$60K - $80K'    : 'c',
    '$80K - $120K'   : 'd',
    '$120K +'        : 'e'   
}

df['newIncome'] = df.Income_Category.map(lambda x : dic[x])
df['newIncome']

0        c
1        a
2        d
3        a
4        c
        ..
10122    b
10123    b
10124    a
10125    b
10126    a
Name: newIncome, Length: 10127, dtype: object

In [114]:
df.Income_Category.apply(lambda x : dic[x])

0        c
1        a
2        d
3        a
4        c
        ..
10122    b
10123    b
10124    a
10125    b
10126    a
Name: Income_Category, Length: 10127, dtype: object

In [116]:
df.Customer_Age.max()

73

In [ ]:
df.

In [117]:
def age(x) : 
  if x<10 :
    return 0
  elif x<20 :
    return 10
  elif x<30 :
    return 20
  elif x<40 :
    return 30
  elif x<50 :
    return 40
  elif x<60 :
    return 50
  elif x<70 :
    return 60
  elif x<80 :
    return 70

In [124]:
df['AgeState'] = df.Customer_Age.apply(age)
df[['Customer_Age','AgeState']]

       Customer_Age  AgeState
0                45        40
1                49        40
2                51        50
3                40        40
4                40        40
...             ...       ...
10122            50        50
10123            41        40
10124            44        40
10125            30        30
10126            43        40

[10127 rows x 2 columns]

In [129]:
df['AgeState'].value_counts().sort_index()

20     195
30    1841
40    4561
50    2998
60     530
70       2
Name: AgeState, dtype: int64

In [141]:
def def1(x) :
  if 'Graduate' in x :
    return 1
  else :
    return 0

In [142]:
def1('Graduate hello')

1

In [143]:
df['newEduLevel'] = df.Education_Level.apply(def1)

In [146]:
df['newEduLevel'].value_counts()

0    6483
1    3644
Name: newEduLevel, dtype: int64

In [147]:
def def2(x) :
  if x > 4500 :
    return 1
  else :
    return 0

In [152]:
df['newLimit'] = df.Credit_Limit.apply(lambda x: 1 if x>=4500 else 0)

In [151]:
df[['newLimit','Credit_Limit']]

       newLimit  Credit_Limit
0             1       12691.0
1             1        8256.0
2             0        3418.0
3             0        3313.0
4             1        4716.0
...         ...           ...
10122         0        4003.0
10123         0        4277.0
10124         1        5409.0
10125         1        5281.0
10126         1       10388.0

[10127 rows x 2 columns]

In [158]:
def def3(x) :
  if x.Marital_Status == 'Married' and x.Card_Category == 'Platinum' :
    return 1
  else :
    return 0

In [159]:
df['newState'] = df.apply(def3,axis=1)
df['newState'].value_counts()

0    10120
1        7
Name: newState, dtype: int64

In [162]:
df.apply(lambda x : 1 if x.Marital_Status == 'Married' and x.Card_Category == 'Platinum'
else 0, axis=1).value_counts()

0    10120
1        7
dtype: int64

In [163]:
def gender(x) :
  if x == 'M' :
    return 'male'
  elif x == 'F' :
    return 'female'

In [164]:
df['Gender'] = df.Gender.apply(gender)
df['Gender'].value_counts()

female    5358
male      4769
Name: Gender, dtype: int64

05. Time Series

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/timeTest.csv')
df

        Yr_Mo_Dy    RPT    VAL    ROS    KIL  ...    CLA    MUL    CLO    BEL    MAL
0     2061-01-01  15.04  14.96  13.17   9.29  ...  10.25  10.83  12.58  18.50  15.04
1     2061-01-02  14.71    NaN  10.83   6.50  ...  10.04   9.79   9.67  17.54  13.83
2     2061-01-03  18.50  16.88  12.33  10.13  ...    NaN   8.50   7.67  12.75  12.71
3     2061-01-04  10.58   6.63  11.75   4.58  ...   1.79   5.83   5.88   5.46  10.88
4     2061-01-05  13.33  13.25  11.42   6.17  ...   6.54  10.92  10.34  12.92  11.83
...          ...    ...    ...    ...    ...  ...    ...    ...    ...    ...    ...
6569  1978-12-27  17.58  16.96  17.62   8.08  ...  15.59  14.04  14.00  17.21  40.08
6570  1978-12-28  13.21   5.46  13.46   5.00  ...  16.25  15.25  18.05  21.79  41.46
6571  1978-12-29  14.00  10.29  14.42   8.71  ...  12.46  14.50  16.42  18.88  29.58
6572  1978-12-30  18.50  14.04  21.29   9.13  ...  12.87  12.46  12.12  14.67  28.79
6573  1978-12-31  20.33  17.41  27.29   9.59  ...  11.63  11.58  11.38  12.08  22.08

[6574 rows x 13 columns]

In [166]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6574 entries, 0 to 6573
Data columns (total 13 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Yr_Mo_Dy  6574 non-null   object
 1   RPT       6568 non-null   float64
 2   VAL       6571 non-null   float64
 3   ROS       6572 non-null   float64
 4   KIL       6569 non-null   float64
 5   SHA       6572 non-null   float64
 6   BIR       6574 non-null   float64
 7   DUB       6571 non-null   float64
 8   CLA       6572 non-null   float64
 9   MUL       6571 non-null   float64
 10  CLO       6573 non-null   float64
 11  BEL       6574 non-null   float64
 12  MAL       6570 non-null   float64
dtypes: float64(12), object(1)
memory usage: 667.8+ KB

In [167]:
df.isnull().sum()

Yr_Mo_Dy    0
RPT         6
VAL         3
ROS         2
KIL         5
SHA         2
BIR         0
DUB         3
CLA         2
MUL         3
CLO         1
BEL         0
MAL         4
dtype: int64

In [4]:
df.Yr_Mo_Dy = pd.to_datetime(df.Yr_Mo_Dy)
df.Yr_Mo_Dy

0      2061-01-01
1      2061-01-02
2      2061-01-03
3      2061-01-04
4      2061-01-05
          ...
6569   1978-12-27
6570   1978-12-28
6571   1978-12-29
6572   1978-12-30
6573   1978-12-31
Name: Yr_Mo_Dy, Length: 6574, dtype: datetime64[ns]

In [170]:
type(df.Yr_Mo_Dy[0])

pandas._libs.tslibs.timestamps.Timestamp

In [3]:
import datetime

In [8]:
df.Yr_Mo_Dy.dt.year.unique()

array([2061, 2062, 2063, 2064, 2065, 2066, 2067, 2068, 2069, 2070, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978])

In [180]:
df.loc[df.Yr_Mo_Dy.dt.year >= 2061,'Yr_Mo_Dy'] = df.Yr_Mo_Dy.dt.year - 100

In [19]:
df.Yr_Mo_Dy.dt.year

0       2061
1       2061
2       2061
3       2061
4       2061
        ...
6569    1978
6570    1978
6571    1978
6572    1978
6573    1978
Name: Yr_Mo_Dy, Length: 6574, dtype: int64

In [12]:
df.Yr_Mo_Dy.dt.day

0        1
1        2
2        3
3        4
4        5
        ..
6569    27
6570    28
6571    29
6572    30
6573    31
Name: Yr_Mo_Dy, Length: 6574, dtype: int64

In [25]:
def fix_century(x) :
  import datetime

  year = x.year - 100 if x.year > 1989 else x.year
  return pd.to_datetime(datetime.date(year, x.month, x.day))

df['Yr_Mo_Dy'] = df['Yr_Mo_Dy'].apply(fix_century)
df['Yr_Mo_Dy'].dt.year.unique()

array([1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978])

In [28]:
import datetime

def def_century(x) :
  import datetime

  if x.year>=2061 :
    year = x.year - 100
  else :
    year = x.year
  
  return pd.to_datetime(datetime.date(year, x.month, x.day))
  
df['Yr_Mo_Dy'] = df['Yr_Mo_Dy'].apply(def_century)
df['Yr_Mo_Dy'].dt.year.unique()

array([1961, 1962, 1963, 1964, 1965, 1966, 1967, 1968, 1969, 1970, 1971,
       1972, 1973, 1974, 1975, 1976, 1977, 1978])

In [33]:
df.groupby(df.Yr_Mo_Dy.dt.year).mean()

                RPT        VAL        ROS  ...        CLO        BEL        MAL
Yr_Mo_Dy                                   ...
1961      12.299583  10.351796  11.362369  ...   9.835577  13.502795  13.680773
1962      12.246923  10.110438  11.732712  ...   9.676247  12.930685  14.323956
1963      12.813452  10.836986  12.541151  ...  10.224438  13.638877  14.999014
1964      12.363661  10.920164  12.104372  ...  10.207951  13.740546  14.910301
1965      12.451370  11.075534  11.848767  ...   9.918082  12.964247  15.591644
1966      13.461973  11.557205  12.020630  ...   9.768959  14.265836  16.307260
1967      12.737151  10.990986  11.739397  ...   9.547425  14.774548  17.135945
1968      11.835628  10.468197  11.409754  ...   7.832978  12.808634  15.017486
1969      11.166356   9.723699  10.902000  ...   7.754384  12.621233  15.762904
1970      12.600329  10.726932  11.730247  ...   8.289808  13.183644  16.456027
1971      11.273123   9.095178  11.088329  ...   7.229753  12.208932  15.025233
1972      12.463962  10.561311  12.058333  ...   7.515273  12.727377  15.028716
1973      11.828466  10.680493  10.680493  ...   7.812411  12.169699  15.441096
1974      13.643096  11.811781  12.336356  ...   8.736356  13.252959  16.947671
1975      12.008575  10.293836  11.564712  ...   7.382822  12.631671  15.307863
1976      11.737842  10.203115  10.761230  ...   7.883087  12.332377  15.471448
1977      13.099616  11.144493  12.627836  ...   8.821616  13.459068  16.590849
1978      12.504356  11.044274  11.380000  ...   8.301699  12.967397  16.771370

[18 rows x 12 columns]

In [40]:
df['weekday'] = df.Yr_Mo_Dy.dt.weekday
df['weekday']

0       6
1       0
2       1
3       2
4       3
       ..
6569    2
6570    3
6571    4
6572    5
6573    6
Name: weekday, Length: 6574, dtype: int64

In [44]:
df['WeekCheck'] = df.weekday.apply(lambda x : 1 if x in [5,6] else 0)
df[['weekday','WeekCheck']]

      weekday  WeekCheck
0           6          1
1           0          0
2           1          0
3           2          0
4           3          0
...       ...        ...
6569        2          0
6570        3          0
6571        4          0
6572        5          1
6573        6          1

[6574 rows x 2 columns]

In [49]:
df.groupby(df.Yr_Mo_Dy.dt.month).mean()

                RPT        VAL        ROS  ...        MAL   weekday  WeekCheck
Yr_Mo_Dy                                   ...
1         14.847325  12.914560  13.299624  ...  18.028763  2.989247   0.284946
2         13.710906  12.111122  12.879132  ...  17.156142  3.005906   0.287402
3         13.158687  11.505842  12.648118  ...  16.909317  3.000000   0.283154
4         12.555648  10.429759  12.204815  ...  14.937611  3.011111   0.288889
5         11.724032  10.145619  11.550394  ...  13.736039  2.982079   0.283154
6         10.451317   8.949704  10.361315  ...  12.861818  3.007407   0.285185
7          9.992007   8.357778   9.349642  ...  12.800789  3.001792   0.288530
8         10.213411   8.415143   9.993441  ...  12.565943  2.991039   0.283154
9         11.458519   9.981002  10.756883  ...  14.761963  3.009259   0.287037
10        12.660610  11.010681  11.453943  ...  16.697151  2.998208   0.286738
11        13.200722  11.639500  12.293407  ...  18.114185  2.992593   0.283333
12        14.446398  12.353602  13.212276  ...  18.697599  3.017921   0.288530

[12 rows x 14 columns]

In [52]:
df = df.fillna(method='ffill').fillna(method='bfill')
df.isnull().sum()

Yr_Mo_Dy     0
RPT          0
VAL          0
ROS          0
KIL          0
SHA          0
BIR          0
DUB          0
CLA          0
MUL          0
CLO          0
BEL          0
MAL          0
weekday      0
WeekCheck    0
dtype: int64

In [54]:
df.groupby(df.Yr_Mo_Dy.dt.to_period('M')).mean()

                RPT        VAL        ROS  ...        MAL   weekday  WeekCheck
Yr_Mo_Dy                                   ...
1961-01   14.932581  12.084194  13.431613  ...  14.703226  2.935484   0.290323
1961-02   16.269286  14.975357  14.324643  ...  15.411786  3.000000   0.285714
1961-03   11.015806  11.296452  10.752903  ...  15.637742  3.000000   0.258065
1961-04   10.722667   9.427667   9.998000  ...  10.278333  3.166667   0.333333
1961-05    9.860968   8.735161  10.818065  ...  12.011613  2.806452   0.258065
...             ...        ...        ...  ...        ...       ...        ...
1978-08    9.645161   8.259355   9.032258  ...  12.054194  2.903226   0.258065
1978-09   10.913667  10.895000  10.635000  ...  19.391333  3.100000   0.300000
1978-10    9.897742   8.670968   9.295806  ...  17.150000  2.935484   0.290323
1978-11   16.151667  14.802667  13.508000  ...  20.723000  2.966667   0.266667
1978-12   16.175484  13.748065  15.635161  ...  21.371613  3.193548   0.322581

[216 rows x 14 columns]

In [58]:
df.Yr_Mo_Dy.dt.to_period('M')

0       1961-01
1       1961-01
2       1961-01
3       1961-01
4       1961-01
         ...
6569    1978-12
6570    1978-12
6571    1978-12
6572    1978-12
6573    1978-12
Name: Yr_Mo_Dy, Length: 6574, dtype: period[M]

In [59]:
df['RPT'].diff()

0        NaN
1      -0.33
2       3.79
3      -7.92
4       2.75
        ...
6569    3.75
6570   -4.37
6571    0.79
6572    4.50
6573    1.83
Name: RPT, Length: 6574, dtype: float64

In [63]:
df[['RPT','VAL']].rolling(7).mean()

            RPT        VAL
0           NaN        NaN
1           NaN        NaN
2           NaN        NaN
3           NaN        NaN
4           NaN        NaN
...         ...        ...
6569  11.868571   9.362857
6570  11.904286   9.595714
6571  13.017143  10.011429
6572  13.285714  10.118571
6573  14.951429  11.801429

[6574 rows x 2 columns]

In [75]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/seoul_pm.csv')
df.head(5)

       (년-월-일:시) PM10등급  PM10 PM2.5등급  ...  일산화탄소등급 일산화탄소  아황산가스등급  아황산가스
0  2021-05-15:15     보통  47.0      보통  ...       좋음   0.4       좋음  0.003
1  2021-05-15:14     보통  43.0      보통  ...       좋음   0.3       좋음  0.003
2  2021-05-15:13     보통  34.0      보통  ...       좋음   0.4       좋음  0.004
3  2021-05-15:12     보통  41.0      보통  ...       좋음   0.4       좋음  0.004
4  2021-05-15:11     보통  51.0      보통  ...       좋음   0.4       좋음  0.005

[5 rows x 13 columns]

In [70]:
df['(년-월-일:시)'].head(24)

0     2021-05-15:15
1     2021-05-15:14
2     2021-05-15:13
3     2021-05-15:12
4     2021-05-15:11
5     2021-05-15:10
6     2021-05-15:09
7     2021-05-15:08
8     2021-05-15:07
9     2021-05-15:06
10    2021-05-15:05
11    2021-05-15:04
12    2021-05-15:03
13    2021-05-15:02
14    2021-05-15:01
15    2021-05-14:24
16    2021-05-14:23
17    2021-05-14:22
18    2021-05-14:21
19    2021-05-14:20
20    2021-05-14:19
21    2021-05-14:18
22    2021-05-14:17
23    2021-05-14:16
Name: (년-월-일:시), dtype: object

In [108]:
def change_date(x) :
  import datetime
  hour = x.split(':')[1]
  date = x.split(':')[0]

  if hour == '24' :
    hour = '00:00:00'

    FinalDate = pd.to_datetime(date + " " + hour) + datetime.timedelta(days=1)

  else :
    hour = hour + ':00:00'
    FinalDate = pd.to_datetime(date + " " + hour)

  return FinalDate

In [109]:
df['(년-월-일:시)'] = df['(년-월-일:시)'].apply(change_date)
df

               (년-월-일:시) PM10등급  PM10  ... 아황산가스등급  아황산가스                test
0    2021-05-15 15:00:00     보통  47.0  ...      좋음  0.003 2021-05-15 15:00:00
1    2021-05-15 14:00:00     보통  43.0  ...      좋음  0.003 2021-05-15 14:00:00
2    2021-05-15 13:00:00     보통  34.0  ...      좋음  0.004 2021-05-15 13:00:00
3    2021-05-15 12:00:00     보통  41.0  ...      좋음  0.004 2021-05-15 12:00:00
4    2021-05-15 11:00:00     보통  51.0  ...      좋음  0.005 2021-05-15 11:00:00
...                  ...    ...   ...  ...     ...    ...                 ...
1234 2021-03-25 05:00:00     보통  39.0  ...      좋음  0.003 2021-03-25 05:00:00
1235 2021-03-25 04:00:00     보통  34.0  ...      좋음  0.002 2021-03-25 04:00:00
1236 2021-03-25 03:00:00     보통  35.0  ...      좋음  0.003 2021-03-25 03:00:00
1237 2021-03-25 02:00:00     보통  35.0  ...      좋음  0.003 2021-03-25 02:00:00
1238 2021-03-25 01:00:00     보통  42.0  ...      좋음  0.003 2021-03-25 01:00:00

[1239 rows x 14 columns]

In [76]:
type(df['(년-월-일:시)'][0])

str

In [81]:
pd.to_datetime('2021-03-25 01')

Timestamp('2021-03-25 01:00:00')

In [106]:
def change_date2(x) :
  import datetime
  hour = x.split(':')[1]
  date = x.split(':')[0]

  if hour == '24' :
    hour = '00:00:00'
    date = str(pd.to_datetime(date) + datetime.timedelta(days = 1))
  else :
    hour = hour + ':00:00'

  return pd.to_datetime(date + " " + hour)

In [104]:
pd.to_datetime('2021 05-15' + " " + '00:00:00' )

Timestamp('2021-05-15 00:00:00')

In [107]:
df['test'] = df['(년-월-일:시)'].apply(change_date2)
df

          (년-월-일:시) PM10등급  PM10  ... 아황산가스등급  아황산가스                test
0     2021-05-15:15     보통  47.0  ...      좋음  0.003 2021-05-15 15:00:00
1     2021-05-15:14     보통  43.0  ...      좋음  0.003 2021-05-15 14:00:00
2     2021-05-15:13     보통  34.0  ...      좋음  0.004 2021-05-15 13:00:00
3     2021-05-15:12     보통  41.0  ...      좋음  0.004 2021-05-15 12:00:00
4     2021-05-15:11     보통  51.0  ...      좋음  0.005 2021-05-15 11:00:00
...             ...    ...   ...  ...     ...    ...                 ...
1234  2021-03-25:05     보통  39.0  ...      좋음  0.003 2021-03-25 05:00:00
1235  2021-03-25:04     보통  34.0  ...      좋음  0.002 2021-03-25 04:00:00
1236  2021-03-25:03     보통  35.0  ...      좋음  0.003 2021-03-25 03:00:00
1237  2021-03-25:02     보통  35.0  ...      좋음  0.003 2021-03-25 02:00:00
1238  2021-03-25:01     보통  42.0  ...      좋음  0.003 2021-03-25 01:00:00

[1239 rows x 14 columns]

In [122]:
import datetime

print(datetime.datetime.now())
print(datetime.datetime.now() + datetime.timedelta(days=1))
print(datetime.datetime.now() + datetime.timedelta(days=2))
print(datetime.datetime.now() + datetime.timedelta(weeks=2))

print(datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S'))

hdate = pd.to_datetime(datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S'))
type(hdate)

hdate2 = hdate.replace(day=26)
print(hdate2)

wdate = datetime.datetime.now().strftime('%Y-%m-%d %H:%M:%S')
type(wdate)

2021-06-13 03:05:29.840759
2021-06-14 03:05:29.840966
2021-06-15 03:05:29.841070
2021-06-27 03:05:29.841163
2021-06-13 03:05:29
2021-06-26 03:05:29

str

##### timedelta 에 들어갈 수 있는 값
* 1주	datetime.timedelta(weeks=1)
* 1일	datetime.timedelta(days=1)
* 1시간	datetime.timedelta(hours=1)
* 1분	datetime.timedelta(minutes=1)
* 1초	datetime.timedelta(seconds=1)
* 1밀리초	datetime.timedelta(milliseconds=1)
* 1마이크로초	datetime.timedelta(microseconds=1)

In [123]:
df['(년-월-일:시)'].dt.weekday.head(4)

0    5
1    5
2    5
3    5
Name: (년-월-일:시), dtype: int64

In [139]:
def engWeek(x) :
  if x == 0 :
    return '월요일'
  elif x == 1 :
    return '화요일'
  elif x == 2 :
    return '수요일'
  elif x == 3 :
    return '목요일'
  elif x == 4 :
    return '금요일'
  elif x == 5 :
    return '토요일'
  elif x == 6 :
    return '일요일'

df['dayName'] = df['(년-월-일:시)'].dt.weekday.apply(engWeek)
df['dayName']

0       토요일
1       토요일
2       토요일
3       토요일
4       토요일
       ...
1234    목요일
1235    목요일
1236    목요일
1237    목요일
1238    목요일
Name: dayName, Length: 1239, dtype: object

In [137]:
df['(년-월-일:시)'].dt.weekday.apply(lambda x : '00' if x == 5 else x)

0       00
1       00
2       00
3       00
4       00
        ..
1234     3
1235     3
1236     3
1237     3
1238     3
Name: (년-월-일:시), Length: 1239, dtype: object

In [140]:
df['dayName'] = df['(년-월-일:시)'].dt.day_name()
df['dayName']

0       Saturday
1       Saturday
2       Saturday
3       Saturday
4       Saturday
          ...
1234    Thursday
1235    Thursday
1236    Thursday
1237    Thursday
1238    Thursday
Name: dayName, Length: 1239, dtype: object

In [150]:
df.groupby(['dayName','PM10등급'],as_index=False).size()

      dayName PM10등급  size
0      Friday     나쁨    31
1      Friday   매우나쁨    17
2      Friday     보통   120
3      Friday     좋음    21
4      Monday     나쁨     1
5      Monday   매우나쁨    21
6      Monday     보통    83
7      Monday     좋음    63
8    Saturday     나쁨    31
9    Saturday   매우나쁨    27
10   Saturday     보통    71
11   Saturday     좋음    54
12     Sunday     나쁨     2
13     Sunday   매우나쁨     1
14     Sunday     보통    67
15     Sunday     좋음    98
16   Thursday     나쁨    41
17   Thursday     보통   144
18   Thursday     좋음     5
19    Tuesday     나쁨    13
20    Tuesday   매우나쁨    10
21    Tuesday     보통    71
22    Tuesday     좋음    74
23  Wednesday     나쁨    26
24  Wednesday     보통    95
25  Wednesday     좋음    46

In [151]:
df.groupby(['dayName','PM10등급']).size()

dayName    PM10등급
Friday     나쁨         31
           매우나쁨       17
           보통        120
           좋음         21
Monday     나쁨          1
           매우나쁨       21
           보통         83
           좋음         63
Saturday   나쁨         31
           매우나쁨       27
           보통         71
           좋음         54
Sunday     나쁨          2
           매우나쁨        1
           보통         67
           좋음         98
Thursday   나쁨         41
           보통        144
           좋음          5
Tuesday    나쁨         13
           매우나쁨       10
           보통         71
           좋음         74
Wednesday  나쁨         26
           보통         95
           좋음         46
dtype: int64

In [154]:
# 연속 판단 :
# 시간을 차분했을 경우 첫 값은 nan, 이후 모든 차분값이 동일하면 연속이라 판단한다.
check = len(df['(년-월-일:시)'].diff().unique())
if check == 2:
    print(True)
else:
    print(False)

True

In [170]:
df.groupby(df['(년-월-일:시)'].dt.hour).mean().iloc[[10,22],[0]]

                PM10
(년-월-일:시)
10         70.384615
22         69.941176

In [182]:
df.groupby(df['(년-월-일:시)'].dt.date).mean()['PM10']

(년-월-일:시)
2021-03-25     72.173913
2021-03-26    122.458333
2021-03-27     75.041667
2021-03-28     21.291667
2021-03-29    303.250000
2021-03-30    178.125000
2021-03-31     47.291667
2021-04-01     48.041667
2021-04-02     53.333333
2021-04-03     39.750000
2021-04-04     10.250000
2021-04-05     23.000000
2021-04-06     42.625000
2021-04-07     62.208333
2021-04-08     36.541667
2021-04-09     37.375000
2021-04-10     36.916667
2021-04-11     48.750000
2021-04-12     43.333333
2021-04-13     14.916667
2021-04-14     29.458333
2021-04-15     51.458333
2021-04-16     79.772727
2021-04-17     87.333333
2021-04-18     33.625000
2021-04-19     50.416667
2021-04-20     73.833333
2021-04-21     80.791667
2021-04-22     81.083333
2021-04-23     48.166667
2021-04-24     24.125000
2021-04-25     27.416667
2021-04-26     30.500000
2021-04-27     33.041667
2021-04-28     66.130435
2021-04-29     72.958333
2021-04-30     38.826087
2021-05-01     28.173913
2021-05-02     15.125000
2021-05-03     37.791667
2021-05-04     35.666667
2021-05-05     44.166667
2021-05-06     74.125000
2021-05-07    351.291667
2021-05-08    528.458333
2021-05-09     60.125000
2021-05-10     25.666667
2021-05-11     25.125000
2021-05-12     25.250000
2021-05-13     45.043478
2021-05-14     55.500000
2021-05-15     75.562500
Name: PM10, dtype: float64

In [179]:
df.groupby(df['(년-월-일:시)'].dt.hour).mean().loc[[10,22]]['PM10']

(년-월-일:시)
10    70.384615
22    69.941176
Name: PM10, dtype: float64

In [184]:
df.set_index('(년-월-일:시)', inplace=True, drop= True)

In [185]:
df

                    PM10등급  PM10 PM2.5등급  ...  아황산가스                test   dayName
(년-월-일:시)                                 ...
2021-05-15 15:00:00     보통  47.0      보통  ...  0.003 2021-05-15 15:00:00  Saturday
2021-05-15 14:00:00     보통  43.0      보통  ...  0.003 2021-05-15 14:00:00  Saturday
2021-05-15 13:00:00     보통  34.0      보통  ...  0.004 2021-05-15 13:00:00  Saturday
2021-05-15 12:00:00     보통  41.0      보통  ...  0.004 2021-05-15 12:00:00  Saturday
2021-05-15 11:00:00     보통  51.0      보통  ...  0.005 2021-05-15 11:00:00  Saturday
...                    ...   ...     ...  ...    ...                 ...       ...
2021-03-25 05:00:00     보통  39.0      보통  ...  0.003 2021-03-25 05:00:00  Thursday
2021-03-25 04:00:00     보통  34.0      좋음  ...  0.002 2021-03-25 04:00:00  Thursday
2021-03-25 03:00:00     보통  35.0      좋음  ...  0.003 2021-03-25 03:00:00  Thursday
2021-03-25 02:00:00     보통  35.0      좋음  ...  0.003 2021-03-25 02:00:00  Thursday
2021-03-25 01:00:00     보통  42.0      좋음  ...  0.003 2021-03-25 01:00:00  Thursday

[1239 rows x 14 columns]

In [187]:
df.resample('W').agg(['min','max','mean','std'])

            PM10                      ...  아황산가스
             min     max        mean  ...    max      mean       std
(년-월-일:시)                             ...
2021-03-28   6.0   160.0   72.747368  ...  0.006  0.003274  0.000961
2021-04-04   3.0   598.0   97.148810  ...  0.004  0.002732  0.000541
2021-04-11  17.0   102.0   41.059524  ...  0.004  0.002744  0.000569
2021-04-18   3.0   367.0   48.180723  ...  0.004  0.002464  0.000579
2021-04-25  17.0   126.0   55.119048  ...  0.011  0.003631  0.001763
2021-05-02   3.0    97.0   40.612121  ...  0.006  0.002524  0.000768
2021-05-09   8.0  1024.0  161.660714  ...  0.004  0.002771  0.000579
2021-05-16  16.0   111.0   40.014815  ...  0.006  0.002459  0.001696

[8 rows x 24 columns]

06. Pivot

In [188]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/under5MortalityRate.csv')
df.head(5)

      Location  Period  ...        Dim1        First Tooltip
0  Afghanistan    2019  ...  Both sexes  60.27 [47.44-74.62]
1  Afghanistan    2019  ...        Male  63.83 [50.04-79.16]
2  Afghanistan    2019  ...      Female  56.57 [44.54-70.18]
3  Afghanistan    2018  ...  Both sexes  62.54 [50.64-75.41]
4  Afghanistan    2018  ...        Male  66.08 [53.41-79.76]

[5 rows x 5 columns]

In [192]:
df.drop('Indicator',axis=1, inplace=True)
df.head(3)

      Location  Period        Dim1        First Tooltip
0  Afghanistan    2019  Both sexes  60.27 [47.44-74.62]
1  Afghanistan    2019        Male  63.83 [50.04-79.16]
2  Afghanistan    2019      Female  56.57 [44.54-70.18]

In [199]:
df['First Tooltip'] = df['First Tooltip'].apply(lambda x : float(x.split(' [')[0]))
df.head(3)

      Location  Period        Dim1  First Tooltip
0  Afghanistan    2019  Both sexes          60.27
1  Afghanistan    2019        Male          63.83
2  Afghanistan    2019      Female          56.57

In [195]:
'60.27 [47.44-74.62]'.split(' [')[0]

'60.27'

In [200]:
type(df['First Tooltip'][0])

numpy.float64

In [207]:
target = df.loc[(df['Period'] >= 2015) & (df['Dim1'] == 'Both sexes')]
target

          Location  Period        Dim1  First Tooltip
0      Afghanistan    2019  Both sexes          60.27
3      Afghanistan    2018  Both sexes          62.54
6      Afghanistan    2017  Both sexes          64.94
9      Afghanistan    2016  Both sexes          67.57
12     Afghanistan    2015  Both sexes          70.44
...            ...     ...         ...            ...
29943  Timor-Leste    2019  Both sexes          44.22
29946  Timor-Leste    2018  Both sexes          45.62
29949  Timor-Leste    2017  Both sexes          47.27
29952  Timor-Leste    2016  Both sexes          49.01
29955  Timor-Leste    2015  Both sexes          50.76

[860 rows x 4 columns]

In [208]:
target.pivot(index='Location',columns='Period',values='First Tooltip')

Period                                      2015   2016   2017   2018   2019
Location
Afghanistan                                70.44  67.57  64.94  62.54  60.27
Albania                                     9.57   9.42   9.42   9.53   9.68
Algeria                                    25.18  24.79  24.32  23.81  23.26
Andorra                                     3.53   3.37   3.22   3.09   2.97
Angola                                     88.20  84.21  80.62  77.67  74.69
...                                          ...    ...    ...    ...    ...
Syrian Arab Republic                       23.18  23.27  22.97  22.11  21.53
Tajikistan                                 37.75  36.82  35.81  34.80  33.78
Thailand                                   10.80  10.32   9.86   9.42   9.01
The former Yugoslav Republic of Macedonia  12.97  11.97   9.94   7.83   6.12
Timor-Leste                                50.76  49.01  47.27  45.62  44.22

[172 rows x 5 columns]

In [216]:
df.groupby(['Dim1','Period'],as_index=False).mean().pivot(index='Dim1', columns='Period',values='First Tooltip')

Period            1950        1951        1952  ...       2017       2018       2019
Dim1                                            ...
Both sexes  147.700816  155.537544  157.811094  ...  29.030465  28.083837  27.191744
Female      140.909796  149.210175  151.516094  ...  26.675291  25.782616  24.945349
Male        154.151224  161.538246  163.760781  ...  31.273198  30.283023  29.350349

[3 rows x 70 columns]

In [217]:
df.groupby(['Dim1','Period'],as_index=False).mean().pivot_table(index='Dim1', columns='Period',values='First Tooltip')

Period            1950        1951        1952  ...       2017       2018       2019
Dim1                                            ...
Both sexes  147.700816  155.537544  157.811094  ...  29.030465  28.083837  27.191744
Female      140.909796  149.210175  151.516094  ...  26.675291  25.782616  24.945349
Male        154.151224  161.538246  163.760781  ...  31.273198  30.283023  29.350349

[3 rows x 70 columns]

In [220]:
df.pivot_table(index='Dim1',columns='Period',values='First Tooltip', aggfunc='mean')

Period            1950        1951        1952  ...       2017       2018       2019
Dim1                                            ...
Both sexes  147.700816  155.537544  157.811094  ...  29.030465  28.083837  27.191744
Female      140.909796  149.210175  151.516094  ...  26.675291  25.782616  24.945349
Male        154.151224  161.538246  163.760781  ...  31.273198  30.283023  29.350349

[3 rows x 70 columns]

In [221]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/winter.csv')
df.head(2)

   Year      City     Sport Discipline  ... Country Gender            Event   Medal
0  1924  Chamonix  Biathlon   Biathlon  ...     FRA    Men  Military Patrol  Bronze
1  1924  Chamonix  Biathlon   Biathlon  ...     FRA    Men  Military Patrol  Bronze

[2 rows x 9 columns]

In [224]:
df['Country'].value_counts()

USA    653
CAN    625
NOR    457
URS    440
FIN    434
SWE    433
GER    360
SUI    285
AUT    280
RUS    263
ITA    192
GDR    162
TCH    158
FRA    152
NED    122
FRG     94
KOR     87
CHN     82
GBR     79
CZE     75
JPN     63
EUN     60
POL     27
EUA     21
SLO     18
BLR     15
AUS     15
LAT     15
BEL     13
HUN     12
CRO     11
UKR     11
LIE      9
EST      7
KAZ      7
YUG      7
BUL      6
SVK      5
DEN      5
ESP      2
LUX      2
ROU      2
PRK      2
UZB      1
NZL      1
Name: Country, dtype: int64

In [229]:
kr = df.loc[df['Country'] == 'KOR']

In [230]:
kordf.groupby(['Year','Medal'], as_index=False).size()

    Year   Medal  size
0   1992  Bronze     1
1   1992    Gold     5
2   1992  Silver     1
3   1994  Bronze     1
4   1994    Gold     8
5   1994  Silver     1
6   1998  Bronze     2
7   1998    Gold     6
8   1998  Silver     4
9   2002    Gold     5
10  2002  Silver     2
11  2006  Bronze     2
12  2006    Gold    14
13  2006  Silver     3
14  2010  Bronze     2
15  2010    Gold     6
16  2010  Silver    10
17  2014  Bronze     2
18  2014    Gold     7
19  2014  Silver     5

In [237]:
kordf.groupby(['Year','Medal']).size().unstack()

Medal  Bronze  Gold  Silver
Year
1992      1.0   5.0     1.0
1994      1.0   8.0     1.0
1998      2.0   6.0     4.0
2002      NaN   5.0     2.0
2006      2.0  14.0     3.0
2010      2.0   6.0    10.0
2014      2.0   7.0     5.0

In [240]:
kr.pivot_table(index='Year',columns='Medal',aggfunc='size').fillna(0)

Medal  Bronze  Gold  Silver
Year
1992      1.0   5.0     1.0
1994      1.0   8.0     1.0
1998      2.0   6.0     4.0
2002      0.0   5.0     2.0
2006      2.0  14.0     3.0
2010      2.0   6.0    10.0
2014      2.0   7.0     5.0

In [242]:
df.head(2)

   Year      City     Sport Discipline  ... Country Gender            Event   Medal
0  1924  Chamonix  Biathlon   Biathlon  ...     FRA    Men  Military Patrol  Bronze
1  1924  Chamonix  Biathlon   Biathlon  ...     FRA    Men  Military Patrol  Bronze

[2 rows x 9 columns]

In [244]:
df.pivot_table(index='Sport', columns='Gender',aggfunc='size')

Gender       Men  Women
Sport
Biathlon     270    150
Bobsleigh    416     36
Curling       97     75
Ice Hockey  1231    305
Luge         135     45
Skating      665    564
Skiing      1130    651

In [245]:
df.pivot_table(index='Discipline', columns='Medal',aggfunc='size')

Medal                      Bronze  Gold  Silver
Discipline
Alpine Skiing                 141   143     144
Biathlon                      139   140     141
Bobsleigh                     147   134     141
Cross Country Skiing          263   264     262
Curling                        56    58      58
Figure skating                118   122     119
Freestyle Skiing               34    34      34
Ice Hockey                    512   510     514
Luge                           60    62      58
Nordic Combined                55    55      55
Short Track Speed Skating      96    97      97
Skeleton                       10    10      10
Ski Jumping                    68    69      70
Snowboard                      30    30      30
Speed skating                 190   193     197

07. Merge, Concat

In [248]:
df = pd.read_csv('https://raw.githubusercontent.com/youkyung2/dataAnalysis/master/pandas_data/mergeTEst.csv',index_col= 0)
df.head()

               2010    2011    2012    2013  ...    2016    2017    2018    2019
Location                                     ...
Afghanistan  64.023  61.640  59.367  57.170  ...  51.267  49.560  47.983  46.453
Albania      11.803  10.807   9.943   9.267  ...   8.363   8.363   8.453   8.597
Algeria      23.540  22.907  22.450  22.117  ...  21.257  20.850  20.407  19.930
Andorra       4.240   4.033   3.843   3.667  ...   3.187   3.060   2.933   2.827
Angola       75.713  71.280  67.233  63.570  ...  55.510  53.460  51.757  50.093

[5 rows x 10 columns]

In [249]:
df1 = df.iloc[:4,:]
df2 = df.iloc[4:,:]

display(df1)
display(df2)

               2010    2011    2012    2013  ...    2016    2017    2018    2019
Location                                     ...
Afghanistan  64.023  61.640  59.367  57.170  ...  51.267  49.560  47.983  46.453
Albania      11.803  10.807   9.943   9.267  ...   8.363   8.363   8.453   8.597
Algeria      23.540  22.907  22.450  22.117  ...  21.257  20.850  20.407  19.930
Andorra       4.240   4.033   3.843   3.667  ...   3.187   3.060   2.933   2.827

[4 rows x 10 columns]

                       2010    2011    2012  ...    2017    2018    2019
Location                                     ...
Angola               75.713  71.280  67.233  ...  53.460  51.757  50.093
Antigua and Barbuda   8.667   8.223   7.807  ...   6.230   6.000   5.783
Argentina            12.887  12.380  11.840  ...   9.177   8.680   8.227
Armenia              16.497  15.677  14.897  ...  11.583  11.007  10.497
Australia             3.993   3.803   3.623  ...   3.137   3.090   3.047
Austria               3.573   3.463   3.333  ...   2.943   2.897   2.843

[6 rows x 10 columns]

In [250]:
total = pd.concat([df1, df2])
total

                       2010    2011    2012  ...    2017    2018    2019
Location                                     ...
Afghanistan          64.023  61.640  59.367  ...  49.560  47.983  46.453
Albania              11.803  10.807   9.943  ...   8.363   8.453   8.597
Algeria              23.540  22.907  22.450  ...  20.850  20.407  19.930
Andorra               4.240   4.033   3.843  ...   3.060   2.933   2.827
Angola               75.713  71.280  67.233  ...  53.460  51.757  50.093
Antigua and Barbuda   8.667   8.223   7.807  ...   6.230   6.000   5.783
Argentina            12.887  12.380  11.840  ...   9.177   8.680   8.227
Armenia              16.497  15.677  14.897  ...  11.583  11.007  10.497
Australia             3.993   3.803   3.623  ...   3.137   3.090   3.047
Austria               3.573   3.463   3.333  ...   2.943   2.897   2.843

[10 rows x 10 columns]

In [251]:
df3 = df.iloc[:2,:4]
df4 = df.iloc[5:,3:]

display(df3)
display(df4)

               2010    2011    2012    2013
Location
Afghanistan  64.023  61.640  59.367  57.170
Albania      11.803  10.807   9.943   9.267

                       2013    2014    2015    2016    2017    2018    2019
Location
Antigua and Barbuda   7.420   7.070   6.757   6.483   6.230   6.000   5.783
Argentina            11.283  10.733  10.203   9.683   9.177   8.680   8.227
Armenia              14.170  13.477  12.817  12.183  11.583  11.007  10.497
Australia             3.467   3.343   3.253   3.183   3.137   3.090   3.047
Austria               3.210   3.113   3.043   2.987   2.943   2.897   2.843

In [257]:
pd.concat([df3, df4], join='inner')

                       2013
Location
Afghanistan          57.170
Albania               9.267
Antigua and Barbuda   7.420
Argentina            11.283
Armenia              14.170
Australia             3.467
Austria               3.210

In [260]:
total = pd.concat([df3, df4], axis=1).fillna(0)
total

                       2010    2011    2012  ...    2017    2018    2019
Afghanistan          64.023  61.640  59.367  ...   0.000   0.000   0.000
Albania              11.803  10.807   9.943  ...   0.000   0.000   0.000
Antigua and Barbuda   0.000   0.000   0.000  ...   6.230   6.000   5.783
Argentina             0.000   0.000   0.000  ...   9.177   8.680   8.227
Armenia               0.000   0.000   0.000  ...  11.583  11.007  10.497
Australia             0.000   0.000   0.000  ...   3.137   3.090   3.047
Austria               0.000   0.000   0.000  ...   2.943   2.897   2.843

[7 rows x 11 columns]

In [262]:
df5 = df.T.iloc[:7,:3]
df6 = df.T.iloc[6:,2:5]

display(df5)
display(df6)

Location  Afghanistan  Albania  Algeria
2010           64.023   11.803   23.540
2011           61.640   10.807   22.907
2012           59.367    9.943   22.450
2013           57.170    9.267   22.117
2014           55.080    8.790   21.850
2015           53.107    8.493   21.587
2016           51.267    8.363   21.257

Location  Algeria  Andorra  Angola
2016       21.257    3.187  55.510
2017       20.850    3.060  53.460
2018       20.407    2.933  51.757
2019       19.930    2.827  50.093

In [263]:
pd.merge(df5, df6, on ='Algeria', how='inner', left_index=True, right_index=True)

Location  Afghanistan  Albania  Algeria  Andorra  Angola
2016           51.267    8.363   21.257    3.187   55.51

In [264]:
pd.merge(df5,df6,on='Algeria',how='outer',left_index=True,right_index=True)

Location  Afghanistan  Albania  Algeria  Andorra  Angola
2010           64.023   11.803   23.540      NaN     NaN
2011           61.640   10.807   22.907      NaN     NaN
2012           59.367    9.943   22.450      NaN     NaN
2013           57.170    9.267   22.117      NaN     NaN
2014           55.080    8.790   21.850      NaN     NaN
2015           53.107    8.493   21.587      NaN     NaN
2016           51.267    8.363   21.257    3.187  55.510
2017              NaN      NaN   20.850    3.060  53.460
2018              NaN      NaN   20.407    2.933  51.757
2019              NaN      NaN   19.930    2.827  50.093